---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewShowGrids
source: html/4113b76e-b27b-0a07-02bb-d6c824d14ed3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewShowGrids Property

"Show Grids"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewShowGrids { get; }
```